//const answer = prompt("What is name");
//alert("Hello");

// Task 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().


//const number = Number(prompt("Введіть число"));
//if (number === 10) {
//    alert("Вірно");
//} else {
//   alert("Невірно");
//}

//number === 10 ? alert("Вірно") : alert("Невірно");

//alert(number === 10 ? "Вірно" : "Невірно");

// Task 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

//const min = Math.floor(Math.random() * (59 - 0) + 0);
//console.log(min);
//let rendNum;
//if (min >= 0 && min < 15) {
//  rendNum = "першу чверть";
//} else if (min < 30) {
//  rendNum = "другу чверть";
//} else if (min < 45) {
//  rendNum = "третю чверть";
//} else {
//  rendNum = "четверту чверть";
//}
//alert(`${min} входить у ${rendNum}`);

// Task 2
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//const num = prompt("Введіть число від 1 до 4:");
//let season;
//
//switch (num) {
//  case '1':
//    season = 'зима';
//    break;
//  case '2':
//    season = 'весна';
//    break;
//  case '3':
//    season = 'літо';
//    break;
//  case '4':
//    season = 'осінь';
//    break;
//  default:
//    season = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
//}
//
//console.log(season);

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// Task 8
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

//function min(a, b) {
//    if (typeof a !== 'number' || typeof b !== 'number') {
//    return 'Not a number!';
//  }
//  return a < b ? a : b;
//}
//console.log(min(7, 3));

// Task 7
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

//function getNumbers(min, max) {
  //let sumEven = 0;
  //for (let i = max; i >= min; i--) {
    //console.log(i); 
//
    //if (i % 2 === 0) {
      //sumEven += i;
    //}
  //}
  //return `Сума парних чисел дорівнює: ${sumEven}`;
//}
//console.log(getNumbers(4, 15))

// Task 10

function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log('fizzbuzz');
    } else if (i % 3 === 0) {
      console.log('fizz');
    } else if (i % 5 === 0) {
      console.log('buzz');
    } else {
      console.log(i);
    }
  }
}

fizzBuzz(15);

